app/views/rooms/_form.html.erb

SELECT "themes".* FROM "themes"
---

  <%= f.collection_check_boxes(:theme_ids, Theme.all, :id, :name) do |b| %>