app/views/rooms/show.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."room_id" = $1  [["room_id", 3]]
---
    <h4>Photos</h4>
    <% @room.photos.each do |photo| %>