app/controllers/bookings_controller.rb

  def create
    checkin, checkout = get_dates(booking_params)
    room = Room.find(booking_params[:room_id])

    if room.available?(checkin, checkout)
      total_price = get_total_price(booking_params)
      @booking = current_user.bookings.create(booking_params.merge(total: total_price))
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "bookings" ("user_id", "room_id", "starts_at", "ends_at", "price", "total", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"